; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	infrared3 - mode
	image0 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star6 - direction
	Star4 - direction
	Star5 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
)
(:goal (and
	(pointing satellite1 Star6)
	(pointing satellite2 Star13)
	(have_image Phenomenon7 image0)
	(have_image Planet8 spectrograph1)
	(have_image Star9 image0)
	(have_image Star10 spectrograph4)
	(have_image Star11 spectrograph4)
	(have_image Star12 infrared3)
	(have_image Star13 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
2. (calibrate satellite1 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 9
3. (turn_to satellite1 planet8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet8)
   goals met: 0 of 9
4. (take_image satellite1 planet8 instrument1 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 9
6. (turn_to satellite0 star4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star4)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon7 instrument1 image0)
   added: (have_image phenomenon7 image0)
   goals met: 2 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 9
10. (turn_to satellite0 star10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star10)
   goals met: 2 of 9
11. (take_image satellite0 star10 instrument0 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 3 of 9
12. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 3 of 9
13. (take_image satellite0 star11 instrument0 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 4 of 9
14. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 4 of 9
15. (take_image satellite0 star12 instrument0 infrared3)
   added: (have_image star12 infrared3)
   goals met: 5 of 9
16. (turn_to satellite1 star13 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star13)
   goals met: 5 of 9
17. (take_image satellite1 star13 instrument1 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 6 of 9
18. (turn_to satellite1 star9 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star9)
   goals met: 6 of 9
19. (take_image satellite1 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 7 of 9
20. (turn_to satellite1 star6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star6)
   goals met: 8 of 9
21. (turn_to satellite2 star13 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star13)
   goals met: 9 of 9
